-- ----------------------------------------------------------------------
-- Test: assign/alter a role to a resource group
-- ----------------------------------------------------------------------

DROP ROLE IF EXISTS rg_test_role;
DROP

-- positive
CREATE ROLE rg_test_role;
CREATE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
CREATE ROLE rg_test_role_super SUPERUSER;
CREATE
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)
ALTER ROLE rg_test_role_super NOSUPERUSER;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super SUPERUSER;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)

ALTER ROLE rg_test_role RESOURCE GROUP none;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super RESOURCE GROUP none;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)

ALTER ROLE rg_test_role RESOURCE GROUP default_group;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role';
 rolresgroup 
-------------
 6437        
(1 row)
ALTER ROLE rg_test_role_super RESOURCE GROUP admin_group;
ALTER
SELECT rolresgroup FROM pg_authid WHERE rolname = 'rg_test_role_super';
 rolresgroup 
-------------
 6438        
(1 row)


-- negative
ALTER ROLE rg_test_role RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
ALTER ROLE rg_test_role RESOURCE GROUP admin_group;
ERROR:  only superuser can be assigned to admin resgroup

CREATE ROLE rg_test_role1 RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
-- nonsuper user should not be assigned to admin group
CREATE ROLE rg_test_role1 RESOURCE GROUP admin_group;
ERROR:  only superuser can be assigned to admin resgroup

-- cleanup
DROP ROLE rg_test_role;
DROP
DROP ROLE rg_test_role_super;
DROP

-- ----------------------------------------------------------------------
-- Test: create/drop a resource group
-- ----------------------------------------------------------------------

--start_ignore
DROP RESOURCE GROUP rg_test_group;
ERROR:  resource group "rg_test_group" does not exist
--end_ignore

SELECT * FROM gp_toolkit.gp_resgroup_config;
 groupid | groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority | cpuset | memory_limit 
---------+---------------+-------------+----------------------+-------------------+--------+--------------
 6437    | default_group | 20          | 20                   | 100               | -1     | -1           
 6438    | admin_group   | 10          | 10                   | 100               | -1     | -1           
 6441    | system_group  | 0           | 10                   | 100               | -1     | -1           
(3 rows)

-- negative

-- can't create the reserved resource groups
CREATE RESOURCE GROUP default_group WITH (cpu_hard_quota_limit=10);
ERROR:  resource group "default_group" already exists
CREATE RESOURCE GROUP admin_group WITH (cpu_hard_quota_limit=10);
ERROR:  resource group "admin_group" already exists
CREATE RESOURCE GROUP none WITH (cpu_hard_quota_limit=10);
ERROR:  resource group name "none" is reserved

-- multiple resource groups can't share the same name
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10);
CREATE
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10);
ERROR:  resource group "rg_test_group" already exists
DROP RESOURCE GROUP rg_test_group;
DROP

-- can't specify the resource limit type multiple times
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpu_hard_quota_limit=5, concurrency=1);
ERROR:  found duplicate resource group resource type: concurrency
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=5, cpu_hard_quota_limit=5);
ERROR:  found duplicate resource group resource type: cpu_hard_quota_limit
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0', cpuset='0');
ERROR:  found duplicate resource group resource type: cpuset

-- can't specify both cpu_hard_quota_limit and cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=5, cpuset='0');
ERROR:  can't specify both cpu_hard_quota_limit and cpuset

-- cpu_soft_priority can't be negative value
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=5, cpu_soft_priority=-100);
ERROR:  cpu_soft_priority range is [1, 500]

-- can't specify invalid cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=',');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='12a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0-,');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-1');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='3-1');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=' 0 ');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='4;a');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='-;4');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset=';5');
ERROR:  cpuset invalid
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='5;');
ERROR:  cpuset invalid

---- suppose the core numbered 1024 is not exist
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='1024');
ERROR:  cpu cores 1024 are unavailable on the system
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,');
ERROR:  the length of cpuset reached the upper limit 1024
-- can't alter to invalid cpuset
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0');
CREATE
ALTER RESOURCE GROUP rg_test_group set CPUSET '';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ',';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET 'a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '12a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '0-';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-1';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '3-1';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ' 0 ';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '4;a';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '-;4';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ';5';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '5;';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET ';';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '1;2;';
ERROR:  cpuset invalid
ALTER RESOURCE GROUP rg_test_group set CPUSET '1;2;3';
ERROR:  cpuset invalid
---- suppose the core numbered 1024 is not exist
ALTER RESOURCE GROUP rg_test_group set CPUSET '1024';
ERROR:  cpu cores 1024 are unavailable on the system
ALTER RESOURCE GROUP rg_test_group set CPUSET '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,';
ERROR:  the length of cpuset reached the upper limit 1024
DROP RESOURCE GROUP rg_test_group;
DROP
-- can't drop non-exist resource group
DROP RESOURCE GROUP non_exist_group;
ERROR:  resource group "non_exist_group" does not exist
-- can't drop reserved resource groups
DROP RESOURCE GROUP default_group;
ERROR:  cannot drop default resource group "default_group"
DROP RESOURCE GROUP admin_group;
ERROR:  cannot drop default resource group "admin_group"
DROP RESOURCE GROUP system_group;
ERROR:  cannot drop default resource group "system_group"
DROP RESOURCE GROUP none;
ERROR:  resource group "none" does not exist

-- positive
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10);
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit, cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 20          | 10                   | 100               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpuset='0');
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit, cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 1           | -1                   | 100               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=500);
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit, cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 20          | 10                   | 500               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=-1, cpu_soft_priority=500);
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit, cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 20          | -1                   | 500               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0', cpu_soft_priority=500);
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit, cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 20          | -1                   | 500               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0');
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit,cpu_soft_priority FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority 
---------------+-------------+----------------------+-------------------
 rg_test_group | 20          | -1                   | 100               
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpuset='0;0-1');
CREATE
SELECT groupname,concurrency,cpu_hard_quota_limit,cpu_soft_priority,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | concurrency | cpu_hard_quota_limit | cpu_soft_priority | cpuset 
---------------+-------------+----------------------+-------------------+--------
 rg_test_group | 20          | -1                   | 100               | 0;0-1  
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
-- ----------------------------------------------------------------------
-- Test: boundary check in create resource group syntax
-- ----------------------------------------------------------------------

-- negative: cpu_hard_quota_limit should be in [1, 100]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=101);
ERROR:  cpu_hard_quota_limit range is [1, 100] or equals to -1
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=0);
ERROR:  cpu_hard_quota_limit range is [1, 100] or equals to -1

-- negative: concurrency should be in [1, max_connections]
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=-1, cpu_hard_quota_limit=10);
ERROR:  concurrency range is [0, 'max_connections']
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=26, cpu_hard_quota_limit=10);
ERROR:  concurrency range is [0, 'max_connections']

-- negative: the cores of cpuset in different groups mustn't overlap
CREATE RESOURCE GROUP rg_test_group1 WITH (cpuset='0');
CREATE
CREATE RESOURCE GROUP rg_test_group2 WITH (cpuset='0');
ERROR:  cpu cores 0 are used by resource group rg_test_group1
DROP RESOURCE GROUP rg_test_group1;
DROP

-- negative: cpu_soft_priority should be in [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=0);
ERROR:  cpu_soft_priority range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=-1);
ERROR:  cpu_soft_priority range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=-1024);
ERROR:  cpu_soft_priority range is [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=501);
ERROR:  cpu_soft_priority range is [1, 500]

-- positive: cpu_hard_quota_limit should be in [1, 100]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=60);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=1);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP

-- positive: cpu_soft_priority should be in [1, 500]
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=100);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10, cpu_soft_priority=500);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP

-- positive: concurrency should be in [0, max_connections]
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=0, cpu_hard_quota_limit=10);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=1, cpu_hard_quota_limit=10);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg_test_group WITH (concurrency=25, cpu_hard_quota_limit=10);
CREATE
DROP RESOURCE GROUP rg_test_group;
DROP
CREATE RESOURCE GROUP rg1_test_group WITH (concurrency=1, cpu_hard_quota_limit=10);
CREATE
CREATE RESOURCE GROUP rg2_test_group WITH (concurrency=1, cpu_hard_quota_limit=500);
ERROR:  cpu_hard_quota_limit range is [1, 100] or equals to -1
DROP RESOURCE GROUP rg1_test_group;
DROP
DROP RESOURCE GROUP rg2_test_group;
ERROR:  resource group "rg2_test_group" does not exist

-- ----------------------------------------------------------------------
-- Test: alter a resource group
-- ----------------------------------------------------------------------
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=5);
CREATE

-- ALTER RESOURCE GROUP SET CONCURRENCY N
-- negative: concurrency should be in [1, max_connections]
ALTER RESOURCE GROUP admin_group SET CONCURRENCY 0;
ERROR:  admin_group must have at least one concurrency
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -1;
ERROR:  concurrency range is [0, 'max_connections']
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 26;
ERROR:  concurrency range is [0, 'max_connections']
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -0.5;
ERROR:  syntax error at or near "0.5"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY -0.5;
                                                            ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0.5;
ERROR:  syntax error at or near "0.5"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0.5;
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY a;
ERROR:  syntax error at or near "a"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY a;
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 'abc';
ERROR:  syntax error at or near "'abc'"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 'abc';
                                                           ^
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY '1';
ERROR:  syntax error at or near "'1'"
LINE 1: ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY '1';
                                                           ^
-- positive: concurrency should be in [1, max_connections]
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 0;
ALTER
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 1;
ALTER
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 2;
ALTER
ALTER RESOURCE GROUP rg_test_group SET CONCURRENCY 25;
ALTER

-- ALTER RESOURCE GROUP SET cpu_hard_quota_limit VALUE
-- negative: cpu_hard_quota_limit should be in [1, 100]
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit -0.1;
ERROR:  syntax error at or near "0.1"
LINE 1: ... RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit -0.1;
                                                                   ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit -1;
ALTER
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 0;
ERROR:  cpu_hard_quota_limit range is [1, 100] or equals to -1
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 0.7;
ERROR:  syntax error at or near "0.7"
LINE 1: ...R RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 0.7;
                                                                   ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 1.7;
ERROR:  syntax error at or near "1.7"
LINE 1: ...R RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 1.7;
                                                                   ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 61;
ALTER
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit a;
ERROR:  syntax error at or near "a"
LINE 1: ...TER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit a;
                                                                     ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 'abc';
ERROR:  syntax error at or near "'abc'"
LINE 1: ...RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 'abc';
                                                                 ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 20%;
ERROR:  syntax error at or near "%"
LINE 1: ...R RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 20%;
                                                                     ^
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 0.2%;
ERROR:  syntax error at or near "0.2"
LINE 1: ... RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 0.2%;
                                                                  ^
-- positive: cpu_hard_quota_limit should be in [1, 100]
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 1;
ALTER
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 2;
ALTER
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 60;
ALTER
DROP RESOURCE GROUP rg_test_group;
DROP

-- positive: cpuset and cpu_hard_quota_limit are exclusive,
-- if cpu_hard_quota_limit is set, cpuset is empty
-- if cpuset is set, cpuset is -1
CREATE RESOURCE GROUP rg_test_group WITH (cpu_hard_quota_limit=10);
CREATE
ALTER RESOURCE GROUP rg_test_group SET CPUSET '0';
ALTER
SELECT groupname,cpu_hard_quota_limit,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | cpu_hard_quota_limit | cpuset 
---------------+----------------------+--------
 rg_test_group | -1                   | 0      
(1 row)
ALTER RESOURCE GROUP rg_test_group SET cpu_hard_quota_limit 10;
ALTER
SELECT groupname,cpu_hard_quota_limit,cpuset FROM gp_toolkit.gp_resgroup_config WHERE groupname='rg_test_group';
 groupname     | cpu_hard_quota_limit | cpuset 
---------------+----------------------+--------
 rg_test_group | 10                   | -1     
(1 row)
DROP RESOURCE GROUP rg_test_group;
DROP
